GopalSaraf/Practicals/PSDL/include/proc/pic18f86j16.inc
// Register: ECCP1CON
#define ECCP1CON ECCP1CON
ECCP1CON                                 equ 0FBBh
// bitfield definitions
ECCP1CON_CCP1M_POSN                      equ 0000h
ECCP1CON_CCP1M_POSITION                  equ 0000h
ECCP1CON_CCP1M_SIZE                      equ 0004h
ECCP1CON_CCP1M_LENGTH                    equ 0004h
ECCP1CON_CCP1M_MASK                      equ 000Fh
ECCP1CON_DC1B_POSN                       equ 0004h
ECCP1CON_DC1B_POSITION                   equ 0004h
ECCP1CON_DC1B_SIZE                       equ 0002h
ECCP1CON_DC1B_LENGTH                     equ 0002h
ECCP1CON_DC1B_MASK                       equ 0030h
ECCP1CON_P1M_POSN                        equ 0006h
ECCP1CON_P1M_POSITION                    equ 0006h
ECCP1CON_P1M_SIZE                        equ 0002h
ECCP1CON_P1M_LENGTH                      equ 0002h
ECCP1CON_P1M_MASK                        equ 00C0h
ECCP1CON_CCP1M0_POSN                     equ 0000h
ECCP1CON_CCP1M0_POSITION                 equ 0000h
ECCP1CON_CCP1M0_SIZE                     equ 0001h
ECCP1CON_CCP1M0_LENGTH                   equ 0001h
ECCP1CON_CCP1M0_MASK                     equ 0001h
ECCP1CON_CCP1M1_POSN                     equ 0001h
ECCP1CON_CCP1M1_POSITION                 equ 0001h
ECCP1CON_CCP1M1_SIZE                     equ 0001h
ECCP1CON_CCP1M1_LENGTH                   equ 0001h
ECCP1CON_CCP1M1_MASK                     equ 0002h
ECCP1CON_CCP1M2_POSN                     equ 0002h
ECCP1CON_CCP1M2_POSITION                 equ 0002h
ECCP1CON_CCP1M2_SIZE                     equ 0001h
ECCP1CON_CCP1M2_LENGTH                   equ 0001h
ECCP1CON_CCP1M2_MASK                     equ 0004h
ECCP1CON_CCP1M3_POSN                     equ 0003h
ECCP1CON_CCP1M3_POSITION                 equ 0003h
ECCP1CON_CCP1M3_SIZE                     equ 0001h
ECCP1CON_CCP1M3_LENGTH                   equ 0001h
ECCP1CON_CCP1M3_MASK                     equ 0008h
ECCP1CON_DC1B0_POSN                      equ 0004h
ECCP1CON_DC1B0_POSITION                  equ 0004h
ECCP1CON_DC1B0_SIZE                      equ 0001h
ECCP1CON_DC1B0_LENGTH                    equ 0001h
ECCP1CON_DC1B0_MASK                      equ 0010h
ECCP1CON_DC1B1_POSN                      equ 0005h
ECCP1CON_DC1B1_POSITION                  equ 0005h
ECCP1CON_DC1B1_SIZE                      equ 0001h
ECCP1CON_DC1B1_LENGTH                    equ 0001h
ECCP1CON_DC1B1_MASK                      equ 0020h
ECCP1CON_P1M0_POSN                       equ 0006h
ECCP1CON_P1M0_POSITION                   equ 0006h
ECCP1CON_P1M0_SIZE                       equ 0001h
ECCP1CON_P1M0_LENGTH                     equ 0001h
ECCP1CON_P1M0_MASK                       equ 0040h
ECCP1CON_P1M1_POSN                       equ 0007h
ECCP1CON_P1M1_POSITION                   equ 0007h
ECCP1CON_P1M1_SIZE                       equ 0001h
ECCP1CON_P1M1_LENGTH                     equ 0001h
ECCP1CON_P1M1_MASK                       equ 0080h
ECCP1CON_CCP1Y_POSN                      equ 0004h
ECCP1CON_CCP1Y_POSITION                  equ 0004h
ECCP1CON_CCP1Y_SIZE                      equ 0001h
ECCP1CON_CCP1Y_LENGTH                    equ 0001h
ECCP1CON_CCP1Y_MASK                      equ 0010h
ECCP1CON_CCP1X_POSN                      equ 0005h
ECCP1CON_CCP1X_POSITION                  equ 0005h
ECCP1CON_CCP1X_SIZE                      equ 0001h
ECCP1CON_CCP1X_LENGTH                    equ 0001h
ECCP1CON_CCP1X_MASK                      equ 0020h

// Register: CCPR1
#define CCPR1 CCPR1
CCPR1                                    equ 0FBCh

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0FBCh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 0FBDh

// Register: ECCP1DEL
#define ECCP1DEL ECCP1DEL
ECCP1DEL                                 equ 0FBEh
// bitfield definitions
ECCP1DEL_PDC_POSN                        equ 0000h
ECCP1DEL_PDC_POSITION                    equ 0000h
ECCP1DEL_PDC_SIZE                        equ 0007h
ECCP1DEL_PDC_LENGTH                      equ 0007h
ECCP1DEL_PDC_MASK                        equ 007Fh
ECCP1DEL_PRSEN_POSN                      equ 0007h
ECCP1DEL_PRSEN_POSITION                  equ 0007h
ECCP1DEL_PRSEN_SIZE                      equ 0001h
ECCP1DEL_PRSEN_LENGTH                    equ 0001h
ECCP1DEL_PRSEN_MASK                      equ 0080h
ECCP1DEL_PDC0_POSN                       equ 0000h
ECCP1DEL_PDC0_POSITION                   equ 0000h
ECCP1DEL_PDC0_SIZE                       equ 0001h
ECCP1DEL_PDC0_LENGTH                     equ 0001h
ECCP1DEL_PDC0_MASK                       equ 0001h
ECCP1DEL_PDC1_POSN                       equ 0001h
ECCP1DEL_PDC1_POSITION                   equ 0001h
ECCP1DEL_PDC1_SIZE                       equ 0001h
ECCP1DEL_PDC1_LENGTH                     equ 0001h
ECCP1DEL_PDC1_MASK                       equ 0002h
ECCP1DEL_PDC2_POSN                       equ 0002h
ECCP1DEL_PDC2_POSITION                   equ 0002h
ECCP1DEL_PDC2_SIZE                       equ 0001h
ECCP1DEL_PDC2_LENGTH                     equ 0001h
ECCP1DEL_PDC2_MASK                       equ 0004h
ECCP1DEL_PDC3_POSN                       equ 0003h
ECCP1DEL_PDC3_POSITION                   equ 0003h
ECCP1DEL_PDC3_SIZE                       equ 0001h
ECCP1DEL_PDC3_LENGTH                     equ 0001h
ECCP1DEL_PDC3_MASK                       equ 0008h
ECCP1DEL_PDC4_POSN                       equ 0004h
ECCP1DEL_PDC4_POSITION                   equ 0004h
ECCP1DEL_PDC4_SIZE                       equ 0001h
ECCP1DEL_PDC4_LENGTH                     equ 0001h
ECCP1DEL_PDC4_MASK                       equ 0010h
ECCP1DEL_PDC5_POSN                       equ 0005h
ECCP1DEL_PDC5_POSITION                   equ 0005h
ECCP1DEL_PDC5_SIZE                       equ 0001h
ECCP1DEL_PDC5_LENGTH                     equ 0001h
ECCP1DEL_PDC5_MASK                       equ 0020h
ECCP1DEL_PDC6_POSN                       equ 0006h
ECCP1DEL_PDC6_POSITION                   equ 0006h
ECCP1DEL_PDC6_SIZE                       equ 0001h
ECCP1DEL_PDC6_LENGTH                     equ 0001h
ECCP1DEL_PDC6_MASK                       equ 0040h
ECCP1DEL_P1DC0_POSN                      equ 0000h
ECCP1DEL_P1DC0_POSITION                  equ 0000h
ECCP1DEL_P1DC0_SIZE                      equ 0001h
ECCP1DEL_P1DC0_LENGTH                    equ 0001h
ECCP1DEL_P1DC0_MASK                      equ 0001h
ECCP1DEL_P1DC1_POSN                      equ 0001h
ECCP1DEL_P1DC1_POSITION                  equ 0001h
ECCP1DEL_P1DC1_SIZE                      equ 0001h
ECCP1DEL_P1DC1_LENGTH                    equ 0001h
ECCP1DEL_P1DC1_MASK                      equ 0002h
ECCP1DEL_P1DC2_POSN                      equ 0002h
ECCP1DEL_P1DC2_POSITION                  equ 0002h
ECCP1DEL_P1DC2_SIZE                      equ 0001h
ECCP1DEL_P1DC2_LENGTH                    equ 0001h
ECCP1DEL_P1DC2_MASK                      equ 0004h
ECCP1DEL_P1DC3_POSN                      equ 0003h
ECCP1DEL_P1DC3_POSITION                  equ 0003h
ECCP1DEL_P1DC3_SIZE                      equ 0001h
ECCP1DEL_P1DC3_LENGTH                    equ 0001h
ECCP1DEL_P1DC3_MASK                      equ 0008h
ECCP1DEL_P1DC4_POSN                      equ 0004h
ECCP1DEL_P1DC4_POSITION                  equ 0004h
ECCP1DEL_P1DC4_SIZE                      equ 0001h
ECCP1DEL_P1DC4_LENGTH                    equ 0001h
ECCP1DEL_P1DC4_MASK                      equ 0010h
ECCP1DEL_P1DC5_POSN                      equ 0005h
ECCP1DEL_P1DC5_POSITION                  equ 0005h
ECCP1DEL_P1DC5_SIZE                      equ 0001h
ECCP1DEL_P1DC5_LENGTH                    equ 0001h
ECCP1DEL_P1DC5_MASK                      equ 0020h
ECCP1DEL_P1DC6_POSN                      equ 0006h
ECCP1DEL_P1DC6_POSITION                  equ 0006h
ECCP1DEL_P1DC6_SIZE                      equ 0001h
ECCP1DEL_P1DC6_LENGTH                    equ 0001h
ECCP1DEL_P1DC6_MASK                      equ 0040h
ECCP1DEL_P1RSEN_POSN                     equ 0007h
ECCP1DEL_P1RSEN_POSITION                 equ 0007h
ECCP1DEL_P1RSEN_SIZE                     equ 0001h
ECCP1DEL_P1RSEN_LENGTH                   equ 0001h
ECCP1DEL_P1RSEN_MASK                     equ 0080h

